## Step 3

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
path = r'C:\Users\n04\Desktop\EX4.6 Combining and Exporting Data'

In [3]:
df_cust = pd.read_csv(os.path.join(path,'02 Data','Original','customers.csv'))
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
df_cust.shape

(206209, 10)

## Step 4

In [5]:
#Rename col headings 
df_cust = df_cust.rename(columns = {'First Name': 'firstname','Surnam': 'surname',
                                    'Gender': 'gender','STATE': 'state', 'Age':'age'})
df_cust.columns

Index(['user_id', 'firstname', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

<b> Note: </b> All columns seem useful for EDA so I did not drop any.

## Step 5

In [6]:
# check for mixed type vals in cols
for col in df_cust.columns.tolist():
    mix_type = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[mix_type]) > 0:
        print("ALERT: Mixed-type found in " + col)
    else:
        print("No mixed-type data found in " + col)

No mixed-type data found in user_id
ALERT: Mixed-type found in firstname
No mixed-type data found in surname
No mixed-type data found in gender
No mixed-type data found in state
No mixed-type data found in age
No mixed-type data found in date_joined
No mixed-type data found in n_dependants
No mixed-type data found in fam_status
No mixed-type data found in income

In [8]:
#fix mixed type
df_cust['firstname'] = df_cust['firstname'].astype('str')

In [9]:
# check again to confirm mix type was fixed
for col in df_cust.columns.tolist():
    mix_type = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[mix_type]) > 0:
        print("ALERT: Mixed-type found in " + col)
    else:
        print("No mixed-type data found in " + col)

No mixed-type data found in user_id
No mixed-type data found in firstname
No mixed-type data found in surname
No mixed-type data found in gender
No mixed-type data found in state
No mixed-type data found in age
No mixed-type data found in date_joined
No mixed-type data found in n_dependants
No mixed-type data found in fam_status
No mixed-type data found in income

In [10]:
# change col type and confirm
df_cust['user_id'] = df_cust['user_id'].astype('str')

df_cust.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [11]:
#Check for nulls
df_cust.isna().sum()

user_id         0
firstname       0
surname         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [12]:
#Check for duplicate data

df_cust[df_cust.duplicated()]

Empty DataFrame
Columns: [user_id, firstname, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

## Step 6

In [13]:
df_op = pd.read_pickle(os.path.join(path,'02 Data', 'Prepared', 'ords_prods_grouped.pkl'))
df_op.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,prices,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spend_per_user,high_spenders,median_days_since_prior_ords,frequent_user
0,2539329,1,1,2,8,0.0,196,1,0,Soda,...,9.0,Mid-range product,Regular busy,Most orders,10,New customer,6.367797,Low spender,20.0,Regular customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,9.0,Mid-range product,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,9.0,Mid-range product,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.0,Regular customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,9.0,Mid-range product,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,9.0,Mid-range product,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.0,Regular customer

In [17]:
# confirm type for user_id
df_op['user_id'].dtype

dtype('int64')

In [18]:
#change user_id type
df_op['user_id'] = df_op['user_id'].astype('str')
df_op['user_id'].dtype

dtype('O')

In [19]:
#Check again that customer user id is string
df_cust['user_id'].dtype

dtype('O')

In [22]:
#Combine dataset
df_merge = df_op.merge(df_cust, on = 'user_id', how = 'inner', indicator = True)

In [24]:
df_merge.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,firstname,surname,gender,state,age,date_joined,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,0.0,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [25]:
df_merge.shape

(32404859, 32)

In [23]:
#Check indicator values in merged dataset
df_merge['_merge'].value_counts(dropna = False)

both          32404859
right_only           0
left_only            0
Name: _merge, dtype: int64

## Step 8

In [26]:
#exports
df_merge.to_pickle(os.path.join(path,'02 Data', 'Prepared', 'cust_ords_prods_merged.pkl'))